### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.tfvars will be created
  + resource "google_storage_bucket_object" "tfvars" {
      + bucket         = "renauto-prod-iac-core-outputs-0"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "tfvars/2-security.auto.tfvars.json"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.project["prod"].google_project.project[0] will be updated in-place
  ~ resource "google_project" "project" {
      ~ auto_create_network = true -> false
      + billing_account     = "017175-CB5AFB-8232DC"
      ~ deletion_policy     = "PREVENT" -> "DELETE"
        id                  = "projects/renauto-prod-sec-core-0"
      ~ labels              = {
          + "environment" = "prod"
        }
        name                = "renauto-prod-sec-core-0"
      ~ terraform_labels    = {
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.project["prod"].google_project_iam_binding.authoritative["roles/iam.securityReviewer"] will be created
  + resource "google_project_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + project = "renauto-prod-sec-core-0"
      + role    = "roles/iam.securityReviewer"
    }

  # module.project["prod"].google_project_iam_member.service_agents["certificatemanager"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-175192338400@gcp-sa-certificatemanager.iam.gserviceaccount.com"
      + project = "renauto-prod-sec-core-0"
      + role    = "roles/certificatemanager.serviceAgent"
    }

  # module.project["prod"].google_project_iam_member.service_agents["cloudkms"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-175192338400@gcp-sa-cloudkms.iam.gserviceaccount.com"
      + project = "renauto-prod-sec-core-0"
      + role    = "roles/cloudkms.serviceAgent"
    }

  # module.project["prod"].google_project_service.project_services["certificatemanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "renauto-prod-sec-core-0"
      + service                    = "certificatemanager.googleapis.com"
    }

  # module.project["prod"].google_project_service.project_services["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "renauto-prod-sec-core-0"
      + service                    = "cloudkms.googleapis.com"
    }

  # module.project["prod"].google_project_service.project_services["privateca.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "renauto-prod-sec-core-0"
      + service                    = "privateca.googleapis.com"
    }

  # module.project["prod"].google_project_service.project_services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "renauto-prod-sec-core-0"
      + service                    = "secretmanager.googleapis.com"
    }

  # module.project["prod"].google_project_service.project_services["stackdriver.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "renauto-prod-sec-core-0"
      + service                    = "stackdriver.googleapis.com"
    }

  # module.project["prod"].google_project_service_identity.default["certificatemanager.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "renauto-prod-sec-core-0"
      + service = "certificatemanager.googleapis.com"
    }

  # module.project["prod"].google_project_service_identity.default["cloudkms.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "renauto-prod-sec-core-0"
      + service = "cloudkms.googleapis.com"
    }

  # module.project["prod"].google_project_service_identity.default["privateca.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "renauto-prod-sec-core-0"
      + service = "privateca.googleapis.com"
    }

  # module.project["prod"].google_project_service_identity.default["secretmanager.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "renauto-prod-sec-core-0"
      + service = "secretmanager.googleapis.com"
    }

  # module.project["prod"].google_tags_tag_binding.binding["environment"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = "//cloudresourcemanager.googleapis.com/projects/175192338400"
      + tag_value = "tagValues/281481129538671"
    }

Plan: 14 to add, 1 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "custom_roles" but a value

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "service_accounts" but a

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 9 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `skipped`

*Pusher: @Sofiane-Truman, Action: `pull_request`, Working Directory: ``, Workflow: `FAST security stage`*